src/main/resources/weather.getSupportProvince.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:web="http://WebXml.com.cn/">
	<soapenv:Header />
	<soapenv:Body>
		<web:getSupportProvince />
	</soapenv:Body>
</soapenv:Envelope>